import '../models/hadith.dart';

class Mydata {
  //static Map<String, Hadith> maphadiths = Map<String, Hadith>();
  static List<Hadith> listhadiths = <Hadith>[];
  // static Hadith hadith = Hadith(
  //   key: '',
  //   nameHadith: '',
  //   textHadith: '',
  //   explanationHadith: "",
  //   translateNarrator: "",
  //   audioHadith: '',
  // );

  static Future<List<Hadith>> getAlldata() async {
    listhadiths.clear();

    // #1
    listhadiths.add(
      Hadith(
        hadithBook :1,
        hadithFasl:1,
       hadithNumber:1,
        nameHadith: 'الأعمال بالنيات',
        textHadith:
            'عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ : { إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ ، وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى ، فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرتُهُ إلى اللهِ وَرَسُوُله ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ } رواه إماما المحدثين أبو عبدالله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بَرْدِزْبَهْ البخاري ، وأبو الحسين مسلم بن الحجَّاج ين مسلم القشيري النيسابوري ، في صحيحيهما اللَذين هما أصح الكتب المصنفة .',
        explanationHadith:
            '(سَمِعْتُ) دليل على أنه أخذه من النبي بلا واسطة . (إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ) فيه من أوجه البلاغة الحصر ، وهو : إثبات الحكم في المذكور ونفيه عما سواه . وطريق الحصر : (إِنَّمَا) لأن (إِنَّمَا) تفيد الحصر . ( وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى) . (وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ ) من البلاغة : إخفاء نية من هاجر للدنيا ، لقوله : (فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ) ولم يقل : إلى دنيا يصيبها ، والفائدة البلاغية في ذلك هي : تحقير ما هاجر إليه هذا الرجل ، أي ليس أهلاً لأن يذكر ، بل يكنى عنه بقوله : (إِلى مَا هَاجَرَ إلَيْهِ) . (فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله) الجواب : (فَهِجْرتُهُ إلى اللهِ وَرَسُوُله) فذكره تنويهاً بفضله.',
        translateNarrator:
         
            'هو عمر بن الخطاب بن نفيل بن عبدالعزى بن رباح بن عبدالله بن قرط بن رزاح بن عدي بن كعب بن لؤي القرشي العدوي، ، وهو أحد الصحابة الكبار والذي ولد في عام الفيل ، كان كافراً في بداية الدعوة إلى الاسلام ، كان من أسياد قريش وكان الرسول دوماً يدعو ( اللهم أعز الاسلام بأحد العمرين ) ، حتى كان عز الاسلام بعمر بن الخطاب . كان المسلمون قبل إسلام عمر بن الخطاب يكتمون إسلامهم خوفاً من كبار قريش ، ولكن بعد إسلام عمر بن الخطاب أصبح المسلمون أقوى ، وأصبحوا يجهرون إسلامهم ، كما أنهم خرجوا للطواف حول الكعبة والتكبير بعد إسلام عمر بن الخطاب وايضاً كان عمر بن الخطاب قوي البديهة ، وكان شديد الذكاء ، كما أنه كان معروفاً بقوته ورباطة جأشه ، وكان الكل يخاف مواجهته ، وكان رجل ذو مواقف خالدة و عظيمة . تُوفّي رضي الله عنه بعد أن اغتيل على يد أبي لؤلؤة المجوسي لعنه الله في سنة 24 للهجرة بعد حياة حافلةٍ بالعطاء والبذل والتّضحية .',
      ta5reegHadith:"TA5REEG",
      ),
    );

    // #2
   listhadiths.add(
      Hadith(
        hadithBook :2,
        hadithFasl:1,
       hadithNumber:1,
        nameHadith: 'الأعمال بالنيات',
        textHadith:
            'عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ : { إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ ، وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى ، فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرتُهُ إلى اللهِ وَرَسُوُله ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ } رواه إماما المحدثين أبو عبدالله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بَرْدِزْبَهْ البخاري ، وأبو الحسين مسلم بن الحجَّاج ين مسلم القشيري النيسابوري ، في صحيحيهما اللَذين هما أصح الكتب المصنفة .',
        explanationHadith:
            '(سَمِعْتُ) دليل على أنه أخذه من النبي بلا واسطة . (إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ) فيه من أوجه البلاغة الحصر ، وهو : إثبات الحكم في المذكور ونفيه عما سواه . وطريق الحصر : (إِنَّمَا) لأن (إِنَّمَا) تفيد الحصر . ( وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى) . (وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ ) من البلاغة : إخفاء نية من هاجر للدنيا ، لقوله : (فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ) ولم يقل : إلى دنيا يصيبها ، والفائدة البلاغية في ذلك هي : تحقير ما هاجر إليه هذا الرجل ، أي ليس أهلاً لأن يذكر ، بل يكنى عنه بقوله : (إِلى مَا هَاجَرَ إلَيْهِ) . (فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله) الجواب : (فَهِجْرتُهُ إلى اللهِ وَرَسُوُله) فذكره تنويهاً بفضله.',
        translateNarrator:
         
            'هو عمر بن الخطاب بن نفيل بن عبدالعزى بن رباح بن عبدالله بن قرط بن رزاح بن عدي بن كعب بن لؤي القرشي العدوي، ، وهو أحد الصحابة الكبار والذي ولد في عام الفيل ، كان كافراً في بداية الدعوة إلى الاسلام ، كان من أسياد قريش وكان الرسول دوماً يدعو ( اللهم أعز الاسلام بأحد العمرين ) ، حتى كان عز الاسلام بعمر بن الخطاب . كان المسلمون قبل إسلام عمر بن الخطاب يكتمون إسلامهم خوفاً من كبار قريش ، ولكن بعد إسلام عمر بن الخطاب أصبح المسلمون أقوى ، وأصبحوا يجهرون إسلامهم ، كما أنهم خرجوا للطواف حول الكعبة والتكبير بعد إسلام عمر بن الخطاب وايضاً كان عمر بن الخطاب قوي البديهة ، وكان شديد الذكاء ، كما أنه كان معروفاً بقوته ورباطة جأشه ، وكان الكل يخاف مواجهته ، وكان رجل ذو مواقف خالدة و عظيمة . تُوفّي رضي الله عنه بعد أن اغتيل على يد أبي لؤلؤة المجوسي لعنه الله في سنة 24 للهجرة بعد حياة حافلةٍ بالعطاء والبذل والتّضحية .',
      ta5reegHadith:"TA5REEG",
      ),
    );
    listhadiths.add(
      Hadith(
        hadithBook :3,
        hadithFasl:1,
       hadithNumber:1,
        nameHadith: 'الأعمال بالنيات',
        textHadith:
            'عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ : { إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ ، وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى ، فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرتُهُ إلى اللهِ وَرَسُوُله ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ } رواه إماما المحدثين أبو عبدالله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بَرْدِزْبَهْ البخاري ، وأبو الحسين مسلم بن الحجَّاج ين مسلم القشيري النيسابوري ، في صحيحيهما اللَذين هما أصح الكتب المصنفة .',
        explanationHadith:
            '(سَمِعْتُ) دليل على أنه أخذه من النبي بلا واسطة . (إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ) فيه من أوجه البلاغة الحصر ، وهو : إثبات الحكم في المذكور ونفيه عما سواه . وطريق الحصر : (إِنَّمَا) لأن (إِنَّمَا) تفيد الحصر . ( وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى) . (وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ ) من البلاغة : إخفاء نية من هاجر للدنيا ، لقوله : (فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ) ولم يقل : إلى دنيا يصيبها ، والفائدة البلاغية في ذلك هي : تحقير ما هاجر إليه هذا الرجل ، أي ليس أهلاً لأن يذكر ، بل يكنى عنه بقوله : (إِلى مَا هَاجَرَ إلَيْهِ) . (فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله) الجواب : (فَهِجْرتُهُ إلى اللهِ وَرَسُوُله) فذكره تنويهاً بفضله.',
        translateNarrator:
         
            'هو عمر بن الخطاب بن نفيل بن عبدالعزى بن رباح بن عبدالله بن قرط بن رزاح بن عدي بن كعب بن لؤي القرشي العدوي، ، وهو أحد الصحابة الكبار والذي ولد في عام الفيل ، كان كافراً في بداية الدعوة إلى الاسلام ، كان من أسياد قريش وكان الرسول دوماً يدعو ( اللهم أعز الاسلام بأحد العمرين ) ، حتى كان عز الاسلام بعمر بن الخطاب . كان المسلمون قبل إسلام عمر بن الخطاب يكتمون إسلامهم خوفاً من كبار قريش ، ولكن بعد إسلام عمر بن الخطاب أصبح المسلمون أقوى ، وأصبحوا يجهرون إسلامهم ، كما أنهم خرجوا للطواف حول الكعبة والتكبير بعد إسلام عمر بن الخطاب وايضاً كان عمر بن الخطاب قوي البديهة ، وكان شديد الذكاء ، كما أنه كان معروفاً بقوته ورباطة جأشه ، وكان الكل يخاف مواجهته ، وكان رجل ذو مواقف خالدة و عظيمة . تُوفّي رضي الله عنه بعد أن اغتيل على يد أبي لؤلؤة المجوسي لعنه الله في سنة 24 للهجرة بعد حياة حافلةٍ بالعطاء والبذل والتّضحية .',
      ta5reegHadith:"TA5REEG",
      ),
    );
    listhadiths.add(
      Hadith(
        hadithBook :4,
        hadithFasl:1,
       hadithNumber:1,
        nameHadith: 'الأعمال بالنيات',
        textHadith:
            'عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ : { إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ ، وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى ، فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرتُهُ إلى اللهِ وَرَسُوُله ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ } رواه إماما المحدثين أبو عبدالله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بَرْدِزْبَهْ البخاري ، وأبو الحسين مسلم بن الحجَّاج ين مسلم القشيري النيسابوري ، في صحيحيهما اللَذين هما أصح الكتب المصنفة .',
        explanationHadith:
            '(سَمِعْتُ) دليل على أنه أخذه من النبي بلا واسطة . (إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ) فيه من أوجه البلاغة الحصر ، وهو : إثبات الحكم في المذكور ونفيه عما سواه . وطريق الحصر : (إِنَّمَا) لأن (إِنَّمَا) تفيد الحصر . ( وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى) . (وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ ) من البلاغة : إخفاء نية من هاجر للدنيا ، لقوله : (فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ) ولم يقل : إلى دنيا يصيبها ، والفائدة البلاغية في ذلك هي : تحقير ما هاجر إليه هذا الرجل ، أي ليس أهلاً لأن يذكر ، بل يكنى عنه بقوله : (إِلى مَا هَاجَرَ إلَيْهِ) . (فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله) الجواب : (فَهِجْرتُهُ إلى اللهِ وَرَسُوُله) فذكره تنويهاً بفضله.',
        translateNarrator:
         
            'هو عمر بن الخطاب بن نفيل بن عبدالعزى بن رباح بن عبدالله بن قرط بن رزاح بن عدي بن كعب بن لؤي القرشي العدوي، ، وهو أحد الصحابة الكبار والذي ولد في عام الفيل ، كان كافراً في بداية الدعوة إلى الاسلام ، كان من أسياد قريش وكان الرسول دوماً يدعو ( اللهم أعز الاسلام بأحد العمرين ) ، حتى كان عز الاسلام بعمر بن الخطاب . كان المسلمون قبل إسلام عمر بن الخطاب يكتمون إسلامهم خوفاً من كبار قريش ، ولكن بعد إسلام عمر بن الخطاب أصبح المسلمون أقوى ، وأصبحوا يجهرون إسلامهم ، كما أنهم خرجوا للطواف حول الكعبة والتكبير بعد إسلام عمر بن الخطاب وايضاً كان عمر بن الخطاب قوي البديهة ، وكان شديد الذكاء ، كما أنه كان معروفاً بقوته ورباطة جأشه ، وكان الكل يخاف مواجهته ، وكان رجل ذو مواقف خالدة و عظيمة . تُوفّي رضي الله عنه بعد أن اغتيل على يد أبي لؤلؤة المجوسي لعنه الله في سنة 24 للهجرة بعد حياة حافلةٍ بالعطاء والبذل والتّضحية .',
      ta5reegHadith:"TA5REEG",
      ),
    );
    listhadiths.add(
      Hadith(
        hadithBook :5,
        hadithFasl:1,
       hadithNumber:1,
        nameHadith: 'الأعمال بالنيات',
        textHadith:
            'عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ : { إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ ، وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى ، فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرتُهُ إلى اللهِ وَرَسُوُله ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ } رواه إماما المحدثين أبو عبدالله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بَرْدِزْبَهْ البخاري ، وأبو الحسين مسلم بن الحجَّاج ين مسلم القشيري النيسابوري ، في صحيحيهما اللَذين هما أصح الكتب المصنفة .',
        explanationHadith:
            '(سَمِعْتُ) دليل على أنه أخذه من النبي بلا واسطة . (إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ) فيه من أوجه البلاغة الحصر ، وهو : إثبات الحكم في المذكور ونفيه عما سواه . وطريق الحصر : (إِنَّمَا) لأن (إِنَّمَا) تفيد الحصر . ( وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى) . (وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ ) من البلاغة : إخفاء نية من هاجر للدنيا ، لقوله : (فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ) ولم يقل : إلى دنيا يصيبها ، والفائدة البلاغية في ذلك هي : تحقير ما هاجر إليه هذا الرجل ، أي ليس أهلاً لأن يذكر ، بل يكنى عنه بقوله : (إِلى مَا هَاجَرَ إلَيْهِ) . (فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله) الجواب : (فَهِجْرتُهُ إلى اللهِ وَرَسُوُله) فذكره تنويهاً بفضله.',
        translateNarrator:
         
            'هو عمر بن الخطاب بن نفيل بن عبدالعزى بن رباح بن عبدالله بن قرط بن رزاح بن عدي بن كعب بن لؤي القرشي العدوي، ، وهو أحد الصحابة الكبار والذي ولد في عام الفيل ، كان كافراً في بداية الدعوة إلى الاسلام ، كان من أسياد قريش وكان الرسول دوماً يدعو ( اللهم أعز الاسلام بأحد العمرين ) ، حتى كان عز الاسلام بعمر بن الخطاب . كان المسلمون قبل إسلام عمر بن الخطاب يكتمون إسلامهم خوفاً من كبار قريش ، ولكن بعد إسلام عمر بن الخطاب أصبح المسلمون أقوى ، وأصبحوا يجهرون إسلامهم ، كما أنهم خرجوا للطواف حول الكعبة والتكبير بعد إسلام عمر بن الخطاب وايضاً كان عمر بن الخطاب قوي البديهة ، وكان شديد الذكاء ، كما أنه كان معروفاً بقوته ورباطة جأشه ، وكان الكل يخاف مواجهته ، وكان رجل ذو مواقف خالدة و عظيمة . تُوفّي رضي الله عنه بعد أن اغتيل على يد أبي لؤلؤة المجوسي لعنه الله في سنة 24 للهجرة بعد حياة حافلةٍ بالعطاء والبذل والتّضحية .',
      ta5reegHadith:"TA5REEG",
      ),
    );
    listhadiths.add(
      Hadith(
        hadithBook :6,
        hadithFasl:1,
       hadithNumber:1,
        nameHadith: 'الأعمال بالنيات',
        textHadith:
            'عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ : { إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ ، وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى ، فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرتُهُ إلى اللهِ وَرَسُوُله ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ } رواه إماما المحدثين أبو عبدالله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بَرْدِزْبَهْ البخاري ، وأبو الحسين مسلم بن الحجَّاج ين مسلم القشيري النيسابوري ، في صحيحيهما اللَذين هما أصح الكتب المصنفة .',
        explanationHadith:
            '(سَمِعْتُ) دليل على أنه أخذه من النبي بلا واسطة . (إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ) فيه من أوجه البلاغة الحصر ، وهو : إثبات الحكم في المذكور ونفيه عما سواه . وطريق الحصر : (إِنَّمَا) لأن (إِنَّمَا) تفيد الحصر . ( وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى) . (وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ ) من البلاغة : إخفاء نية من هاجر للدنيا ، لقوله : (فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ) ولم يقل : إلى دنيا يصيبها ، والفائدة البلاغية في ذلك هي : تحقير ما هاجر إليه هذا الرجل ، أي ليس أهلاً لأن يذكر ، بل يكنى عنه بقوله : (إِلى مَا هَاجَرَ إلَيْهِ) . (فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله) الجواب : (فَهِجْرتُهُ إلى اللهِ وَرَسُوُله) فذكره تنويهاً بفضله.',
        translateNarrator:
         
            'هو عمر بن الخطاب بن نفيل بن عبدالعزى بن رباح بن عبدالله بن قرط بن رزاح بن عدي بن كعب بن لؤي القرشي العدوي، ، وهو أحد الصحابة الكبار والذي ولد في عام الفيل ، كان كافراً في بداية الدعوة إلى الاسلام ، كان من أسياد قريش وكان الرسول دوماً يدعو ( اللهم أعز الاسلام بأحد العمرين ) ، حتى كان عز الاسلام بعمر بن الخطاب . كان المسلمون قبل إسلام عمر بن الخطاب يكتمون إسلامهم خوفاً من كبار قريش ، ولكن بعد إسلام عمر بن الخطاب أصبح المسلمون أقوى ، وأصبحوا يجهرون إسلامهم ، كما أنهم خرجوا للطواف حول الكعبة والتكبير بعد إسلام عمر بن الخطاب وايضاً كان عمر بن الخطاب قوي البديهة ، وكان شديد الذكاء ، كما أنه كان معروفاً بقوته ورباطة جأشه ، وكان الكل يخاف مواجهته ، وكان رجل ذو مواقف خالدة و عظيمة . تُوفّي رضي الله عنه بعد أن اغتيل على يد أبي لؤلؤة المجوسي لعنه الله في سنة 24 للهجرة بعد حياة حافلةٍ بالعطاء والبذل والتّضحية .',
      ta5reegHadith:"TA5REEG",
      ),
    );
    return listhadiths;
  }
}